#include <stdio.h>
/*判断x是否完数，是则返回1，否则返回0*/
int isPerfect(int x)
{
    int y,s;                               
    for(s=0,y=1;y<x/2;y++)
    {    if(!(x%y))
            s+=y;
    }
    if(s==x)
        return 1;
    return 0;
}

int main()
{
    int a;
    printf("1000内的完数有：");
    for(a=1;a<=1000;a++) /*遍历所有数*/
        if(isPerfect(a))
            printf("%8d",a);
    return 0;
}
//程序运行到第6行，从观察窗口看到，函数参数已经被赋值为6，局部变量y和s还未被赋值，是系统赋予的随机值，因为第6行代码尚未执行，观察for的执行流程以及变量y和s的值，可以看到当y为3，执行到第6行时，再单步执行，程序会运行到第10行，说明y的值为3时退出循环，3没有加到s中，但是3是6的因子，按理应该继续循环，可能循环条件表达式描述有问题，漏检了边界值 

